package kr.or.ddit.basic;

/*
	문제) 이름, 주소, 전화번호를 멤버로 갖는 Phone클래스를 만들고, 
		Map을 이용하여 전화번호 정보를 관리하는 프로그램을 작성하시오.
		
		(Map의 구조는 key값으로 입력한 '이름'을 사용하고, value값으로는 'Phone클래스의 인스턴스'로 한다.)
		변수 선언 예시 ) HashMap<String, Phone> 변수명;
		
		이 프로그램에는 다음과 같은 메뉴가 있는데 각 메뉴의 기능을 구현한다.
		----------------
		다음 메뉴를 선택하세요.
		1. 전화번호 등록
		2. 전화번호 수정
		3. 전화번호 삭제
		4. 전화번호 검색
		5. 전화번호 전체 출력
		0. 프로그램 종료
		----------------
		
		- 검색, 삭제 기능은 '이름'을 입력 받아 처리한다.
		
실행 예시)
		----------------
		다음 메뉴를 선택하세요.
		1. 전화번호 등록
		2. 전화번호 수정
		3. 전화번호 삭제
		4. 전화번호 검색
		5. 전화번호 전체 출력
		0. 프로그램 종료
		----------------
		메뉴 선택 >> 1
		
		새롭게 등록할 전화번호 정보를 입력하세요.
		이      름 >> 홍길동
		전화번호 >> 010-1234-5678
		주      소 >> 대전시 중구 오류동
		
		'홍길동' 전화번호 등록 완료!!!
		
		----------------
		다음 메뉴를 선택하세요.
		1. 전화번호 등록
		2. 전화번호 수정
		3. 전화번호 삭제
		4. 전화번호 검색
		5. 전화번호 전체 출력
		0. 프로그램 종료
		----------------
		메뉴 선택 >> 1
		
		새롭게 등록할 전화번호 정보를 입력하세요.
		이      름 >> 홍길동
		
		'홍길동'은 이미 등록된 사람입니다..
		
		----------------
		다음 메뉴를 선택하세요.
		1. 전화번호 등록
		2. 전화번호 수정
		3. 전화번호 삭제
		4. 전화번호 검색
		5. 전화번호 전체 출력
		0. 프로그램 종료
		----------------
		메뉴 선택 >> 5
		
		-------------------------------------------
		번호	이름		전화번호			주소
		-------------------------------------------
		1	홍길동	010-1234-5678	대전시 중구 오류동
			~~~
			~~~
		-------------------------------------------
		출력 끝...
		
		----------------
		다음 메뉴를 선택하세요.
		1. 전화번호 등록
		2. 전화번호 수정
		3. 전화번호 삭제
		4. 전화번호 검색
		5. 전화번호 전체 출력
		0. 프로그램 종료
		----------------
		메뉴 선택 >> 0
		
		프로그램을 종료합니다.

*/

public class PhoneBookTest {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
